import React from "react";
import { useNavigate } from "react-router-dom";
import Button from "@mui/material/Button";
import FastfoodIcon from "@mui/icons-material/Fastfood";
import { styled } from "@mui/material/styles";
import "../styles/Home.css";

const ColorButton = styled(Button)(() => ({
  width: "15rem",
  height: "4rem",
  fontSize: "20px",
  backgroundColor: "#602db9",
  "&:hover": {
    backgroundColor: "#6b32cd",
  },
}));

const Home = () => {
  const navigate = useNavigate();

  return (
    <>
      <div className="home-page-container">
        <div className="home-page-info">
          <FastfoodIcon style={{ fontSize: 300, color: "#f3e4e4" }} />
          <h1>PRIME FOOD</h1>
          <h1 className="home-page-description">Сервіс доставки їжі</h1>
          <ColorButton variant="contained" onClick={() => navigate("/shops")}>
            Меню
          </ColorButton>
        </div>
        <div className="home-page-guide">
          <div className="home-page-guide-info">
            <h1>Як замовити?</h1>
            <ul>
              <li>
                <h3>Обирайте магазин</h3>
              </li>
              <li>
                <h3>Додайте страву до кошика</h3>
              </li>
              <li>
                <h3>Оформлюйте замовлення</h3>
              </li>
              <li>
                <h3>Смакуйте чудовими стравами</h3>
              </li>
            </ul>
          </div>
          <div className="home-page-guide-image"></div>
        </div>

        <div>
          <h2>Про нас</h2>
        </div>
        <h3 className="home-page-about">
          Ласкаво просимо в нашу службу замовлення та доставки їжі! Ми
          пропонуємо широкий вибір смачних страв, які ви можете замовити зручно
          онлайн та отримати доставку прямо до вашого дверей. Незалежно від
          того, чи ви шукаєте сніданок, обід, вечерю або перекус, у нас є щось
          для кожного. Наша команда професійних кухарів готує кожну страву зі
          свіжих та якісних інгредієнтів, щоб забезпечити вам найвищу якість та
          неперевершений смак. Ми підтримуємо різноманітні кухні, включаючи
          національні та міжнародні страви, вегетаріанські та веганські
          альтернативи, а також спеціальні дієтичні обмеження. Замовляти їжу у
          нас дуже просто. Ви можете переглянути наше меню, вибрати бажані
          страви та додати їх до кошика. Ми приймаємо онлайн-платежі, щоб
          забезпечити зручність і безпеку для наших клієнтів. Крім того, ви
          можете вказати бажаний час доставки або самовивезення, щоб
          забезпечити, що ваша їжа буде готова вчасно. Наша служба доставки
          працює оперативно та надійно. Ми прагнемо забезпечити, що ваше
          замовлення буде доставлене свіжим та гарячим, зберігаючи його якість
          та смак протягом всього шляху до вас. Ми піклуємося про ваш комфорт і
          зробимо все можливе, щоб забезпечити приємний досвід замовлення та
          доставки. Замовляйте їжу вже сьогодні і насолоджуйтеся смаком
          найкращих страв без зусиль! Наша команда готова задовольнити ваші
          кулінарні бажання та зробити ваше харчування легким, смачним та
          зручним.
        </h3>
      </div>
    </>
  );
};

export default Home;
